Revit 2026 API

# BuiltInFailuresGenericFailures Class

---

Generic failures that may apply to any Revit Element

SystemObject Autodesk.Revit.DBBuiltInFailuresGenericFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class GenericFailures
```
```vb
Public NotInheritable Class GenericFailures
```
```cpp
public ref class GenericFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type GenericFailures = class end
```

The BuiltInFailuresGenericFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementsInInvalidContext | There are elements in the document that exist in a context they should not. These elements must be deleted to continue using this project or family. |

#### Reference

Autodesk.Revit.DB Namespace